[{"text": "The problem with so many people watching this movie is the mindset they watch it in. People come looking for a B-Grade horror film, or a \"So Bad It's Good\" movie. Jack Frost 2 is neither of these.<br /><br />It is, to put it simply, a very good movie cleverly hidden inside a very bad one. To view it as anything other than a screwball comedy (easily funnier than all three absolutely meritless \"Scary Movies\" combined) is to misinterpret the movie on a basic level. It would be like watching Shawshank Redemption and then complaining that there were no explosions.<br /><br />The premise is simple; the characters from the first movie, haunted by memories of Jack Frost, take a vacation to a tropical island. A new, improved Jack comes after them, now with essentially the powers of Hydro-Man from Spider-Man; essentially, he can turn from water to snow easily and quickly, divide himself, multiply himself, and, worst of all, he's managed to grow an immunity to his only former weakness...AntiFreeze.<br /><br />What's sad about this movie is that the brain dead fans of the first Jack Frost (a simply HORRIBLE movie) can't appreciate the change of tone for the sequel. Just as Alien was a horror film and Aliens was all about action, Jack Frost was a weak attempt at gimmick horror and Jack Frost 2 is a cleverly written parody of the gimmick horror genre.<br /><br />Most of the entertainment comes the live action actors, who serve admirably. Particularly funny among them are Ray Tooney (playing a caricature of a retired British Colonel from the early 1900s), Christopher Allport (offering an insane, hilarious spin on his wooden performance from the first film), and David Allen Brooks (taking the once serious role of manners to new, totally bizarre heights).<br /><br />The lack of \"memorable quotes\" disturbs me.<br /><br />As a horror movie, Jack Frost 2: Revenge of The Mutant Killer Snowman, rates a zero. But you have to understand, IT'S NOT A HORROR MOVIE.", "label": 1, "predicted": 0}, {"text": "Can't grade this very well, because I can't say I liked it. But it is the story that bothered me, not the realization of the film. The acting, directing, atmosphere, music were all good. It's just that after you see a bunch of people doing things you can't truly relate to, the movie ends. It is educational in the way that it shows the horrors of war as seen from home and the way feelings don't need to make any sense at all and still be strong, but that's about it.<br /><br />The plot covers a period of a few years in which the poet Dylan Thomas is taken under the roof of a former ex-girlfriend. He is married, brings his wife and later the kid, while the ex (Knightley) marries some other guy. But the tension is there, Dylan is a self obsessed jerk and the new husband comes back home from the war with a slight case of PTSD. Add in some pretty temperamental characters and you have your hands full.<br /><br />Bottom line: you have to be \"in the mood\" to like this film. The hard part is defining this mood. I don't think I've ever been in it yet. Ever. So it is probably better watched by adults with a grasp on weird complex human behaviour and maybe a curiosity about Dylan Thomas.", "label": 1, "predicted": 0}, {"text": "Now, I've seen many many B-grade films in my 15 years of living, and I must say that this was one of the better ones. I personally enjoyed the real estate and the storyline, but it did suffer from amateur acting (although Adrienne Barbeau did give a decent performance as Lisa Grant). Joseph Bottoms couldn't hold his part well enough to be considered good. The other performance which really fit the film was that of Barry Hope (Barney Resnick). It begins with an eager real estate agent taking an Asian couple through a house, only to find there's a dead girl in the shower of the showhome. It progresses with detective speculating, and introduces the key characters with reasonable grace. I think that for any person who's in for a giggle at the over-the-top drama the victim realtors provide during the over-the-top gory scenes, this truly is a gem... XD Who am I kidding? It's not that great, but worth a watch if you're insanely bored.", "label": 1, "predicted": 0}, {"text": "The script seems to have been wholesale (ahem ahem, cough cough) \"borrowed\" from a certain other movie involving using a self-propelled manned drilling machine. Scene by scene, the two movies were almost identical. Just enough of the serial numbers filed off in this one to prevent a copyright infringement lawsuit.<br /><br />But other than that, I have to say I found this somewhat entertaining as I enjoy deep-underground-in-the-earth genre of movies. It's a little bit on the stupid side as far as the science goes, but if one is willing to squint one's eyes real hard and pretend one didn't notice that scientific gaffe here and there and all over, this movie is almost bearable. Far better than \"Supernova\" which was another flick that Luke Perry had a leading role in that was so dumb, dumb, dumb that nothing could save it. A note to movie makers: employ someone who knows something about the subject the movie deals with. It would be a very small part of the movie budget, but it would have a big effect overall in helping prevent your audience from guffawing at you for doing dumb science.<br /><br />Production values: almost passable. I've seen far worse in my time.<br /><br />A new thought for disaster movies: instead of them always having a happy ending where the world gets saved yet once again, how about some where things are a tad bit more realistic, where sometimes even the very best efforts still end up in failure. Particularly when the problem that needs to be resolved was caused in the first place by sheer stupidity. Stupidity-caused disaster movies with glowing, heartwarming endings sort of backhandedly justify stupidity by stating, \"No matter how awful a problem is caused by braindead stupidity, it can be fixed.\" Which is definitely not the case. A self-caused disaster movie with an unhappy ending would serve better as cautionary tale of \"Don't be so damn stupid in the first place.\" Should you watch this movie? If you're bored and you've seen everything else in the scifi section at your local video rental store, sure, why not. But do avoid \"Supernova\" as I can assure you that you're not THAT bored. That definitely was not one of Luke Perry's better movies. This one is better. That's not saying much, but it is better.<br /><br />One dead hoof up for being a deep-underground genre movie. One dead hoof down for naughtily ripping off from the screenplay of another certain movie of the same genre.", "label": 0, "predicted": 1}, {"text": "I don't care what anyone says, this movie is hilarious! It combines the bleak seriousness of Threads with an anarchic blend of alternative comedy, and the results are a severely dark, but outrageously funny satire on the brinkmanship policies of both the Western and Eastern blocs at the time. You gotta give the filmmakers credit for even attempting to top the real life lunacy of \"Duck and cover\" or \"Protect and survive\"!<br /><br />Imagine someone made a movie based on the Dead Kennedys track 'Kinky Sex Makes The World Go Round', and you're pretty close to Whoops! Apocalypse. Add Rik Mayall on top form as an insanely OTT SAS commander and you've got it exactly. A worthy companion piece to Dr Strangelove, and that's saying something.", "label": 0, "predicted": 1}, {"text": "I knew little of this movie when I entered the theatre for an advance screening. I gathered from the ads that it was a thriller.<br /><br />What we have is like \"Compulsion\" meets \"Matlock\". Two teens decide to commit a perfect murder. A victim is selected at random and then carefully executed so that no traces of the actual murderers is found. Then a bunch of false leads are planted that point to an innocent bystander. (Innocent of the murder anyway)<br /><br />Enter Sondra Bullock as the investigating officer. (IMDB says that she's FBI, but I don't remember that. I thought that she was a regular cop) She's frustrated by the inconsistency of the killers profile (\"The profile doesn't fit the profile!\") and by the power and influence of the father of one of the boys.<br /><br />She's also has demons of her own which figure prominently in her decicision to become a cop. But this is the only character that is really more than one-dimensional. All others are pretty flat.<br /><br />For a thriller, there are really no big thrills. It's mostly a cat-and-mouse game like an episode of \"Matlock\" (which she's watching at one point in the film). The twist is that there are two involved in the killing. Just who is the real murderer, Justin or Richard? It'll cost you eight bucks to find out.", "label": 1, "predicted": 0}, {"text": "Despite some really scenic locations in the orient and some sporadically energetic music by Franco Micalizzi, this film doesn't quite reach the level of Joe D'Amato's similar efforts while staying just about as trashy. The author of the original book \"Emmanuelle: The Joys of a Woman\", Emmanuelle Arsan, directed and had a smallish role in this film, which mostly pornographically showcases a very young Annie Belle as she gets in a variety of oddball sexual situations. Her boyfriend, played by ZOMBIE's Al Cliver actually approves of her sleeping around and even persuades her to continue her practices even after the two of them are married! Orso Maria Guerrini drops by as a professor who is oh so usually married simultaneously to two women, one of whom is played by Arsan herself. Despite beginning promisingly and having a few hilarious lines of dialog like \"can you see me with the naked eye?\" ... \"I can see you better naked!\", the film shambles along plotlessly up until the less-than-spectacular finale. Much like D'Amato's EMANUELLE AND THE LAST CANNIBALS, the main characters are all in search of some lost tribe, but don't get your hopes up, there's no violence at all in this film, and not much sex either for that matter. Just a lot of nudity and silly dialog. I couldn't help but find some appreciation for this little film, if only for the completely cornball logic the film goes by.", "label": 1, "predicted": 0}, {"text": "Okay, I'll say it. This movie made me laugh so hard that it hurt. This statement may offend some of you who may think that this movie is nothing more than a waste of film. But the thing that most people don't get is that this movie was intended to be bad and cheezy. I mean, did people actually think that a movie about a killer snowman was intended to be a masterpiece? Just look at the \"scary\" hologram on the jacket of the movie and you'll find your answer. Instead, like the original Jack Frost (which I thought was just as funny), this movie turned out to be a side-splitting journey into the depths of corny dialogue, bad one liners and horrible special effects. And it's all made to deliver laughter to us viewers. It certainly worked for me.<br /><br />For example: Anne Tiler (to her troubled husband): What makes you frown so heavily darling?<br /><br />If that chunk of dialogue doesn't make you laugh, then you have serious issues. Who in their right mind would utter those words in real life? Of course, no one because it was meant to sound ridiculous! Just take one viewing of this movie with an open mind and low expectations, and hopefully you'll see what's so damn funny about Jack Frost 2.", "label": 1, "predicted": 0}, {"text": "I have recently found this film on one of my husband's VHS tapes (the blank variety which he uses to record stuff from the telly). The film looks as if it was last shown in the eighties and I don't remember having seen it since. It has not (to my knowledge) been released on DVD or VHS although I shall browse around for a copy.<br /><br />The film tells the story of three young people: two girls, one on the edge of puberty and the other much younger, and a young boy who go to live with their mother's brother and his young, mute Irish wife. His wife also has two brothers who live with them. The children's uncle is an unpleasant control freak who forces his young wife to wear a silver collar whilst she watches a marionette show put on by him and her brothers in his toyshop.<br /><br />The eldest girl and one of the Irishmen (the younger) develop a love for each other whilst they live in the same house. The girl helps her aunt out in the shop whilst her brother helps his uncle to make things in the workshop.<br /><br />There are a lot of very disturbing elements to the film. There is the uncle's treatment of his wife as some kind of dumb (literally) possession (illustrated by the collar) whilst the Irish indulge dancing, drinking and somewhat forbidden love. Interestingly, though, I have seen far more explicit themes played out in other movies made in Hollywood today.<br /><br />Makes you wonder whether the British film industry and the BBC have some kind of hidden agenda going on.<br /><br />Still, despite it not being a children's movie, there are a lot of playful, magic moments in it and the one Irishman does some beautiful paintings.", "label": 0, "predicted": 1}, {"text": "Franco Zeffirelli's (\"The Taming Of The Shrew,\" \"Romeo And Juliet,\" \"Jesus Of Nazareth,\" \"Othello\") third stab at transferring Shakespeare to the screen works very well, with the casting of Mel Gibson (\"Mad Max,\" \"Lethal Weapon\" and pre-\"The Passion Of The Christ\" notoriety) in the role formerly owned by Sir Laurence Olivier (and rightly so; see my review on his \"Hamlet,\" arguably the best interpretation of one of the Bard's timeless (and most quoted) tragedies) and redone 5 years later by Kenneth Branagh as a full-bloodied treatment, explaining its 3 hour 22 minute running time, combined with a dream cast (and a lot of little additions, which were well-chosen and expertly done by the contemporary master of William Shakespeare, Kenneth Branagh, the director of \"Henry V\" and \"Dead Again.\" Joining the \"Lethal Weapon\" star are Glenn Close (\"The Big Chill\"), Paul Scofield (\"A Man For All Seasons\"), Alan Bates, Ian Holm, Michael Maloney (who would be cast as Roderigo opposite Kenneth Branagh and Laurence Fishburne in Oliver Parker's \"Othello\" (see my review of Olivier's \"stage\" version of the tragedy, though he only starred in it) and who Branagh would cast as Laertes in HIS 3-hour version of \"Hamlet\" (a proper homage to Sir Laurence Olivier and his classic version of the play; see my review on that one as well) 5 years later), Nathaniel Parker (who would be cast as Cassio in his brother's version of \"Othello\" 4 years later) and Helena Bonham-Carter, who would be cast in \"Mary Shelley's Frankenstein\" 4 years later. <br /><br />Zeffirelli intended this movie as a homage to Sir Laurence Olivier (who had died 2 years prior to this movie) and it works pretty well, for the most part. What I was slightly uncomfortable with was Zeffirelli's misplacing a lot of lines and in one scene, he gives one of Hamlet's lines to the Ghost. Also, Helena Bonham-Carter DID NOT convince me as Ophelia. She was too dull and unreal, whereas Jean Simmons (who had immortalized the role in Olivier's version) and Kate Winslet (who did an acceptable job in Kenneth Branagh's uncut, epic revisionist reworking of \"Hamlet\") were good in the role, with Jean Simmons being the BEST Ophelia ever, that's why she was nominated for Best Actress in 1948 (she didn't win-what a shame). Ian Holm said his lines too quickly, not slowly as I expected him to, in a scene with him, Laertes and Ophelia. But then again, I'm more used to Felix Aylmer and Richard Briers' interpretations of the role and I think that they did better jobs than Holm in their respective versions of \"Hamlet\" (both done by great directors, actors, text-editors, producers AND stars of all their versions of the Bard's work) as Polonius. <br /><br />The rest of the cast, however, was excellent. The scene where Hamlet confronts his mother was very well done, but Olivier and Branagh heightened the scene to better lengths to create even more emotional intensity and suspense that the scene required. <br /><br />I recommend this version just to pass the time, but it's ideal as a teaching tool for 12th-grade English teachers (I recommend showing Olivier's version first, then Branagh's and finally this version). Despite the film's \"PG\" rating, there was really nothing objectionable in the movie. Only what the play called for. <br /><br />The Best Versions Of \"Hamlet\" Are: <br /><br />#1 Sir Laurence Olivier and Kenneth Branagh. Both were so good that I can't decide which one was the best. See my reviews on these versions for more information. <br /><br />#2 Franco Zeffirelli. This one was alright. It started out alright with a scene not in the play, but should've then progressed to the actual beginning of the play, where a guard cries out \"Who's there?\" \"Nay, answer me. Stand and unfold yourself!!\" That scene scares the hell out of you because you're sitting quietly and then-bam!!, you almost jump out of your skin. In short, that scene sets the tone for the rest of the play. HUGE blunder on Zeffirelli's part to omit that scene. It also misplaced a lot of lines (and cut others that I think should've been put in), such as the line where Hamlet says to Ophelia \"Get thee to a nunnery, why wouldst thou be a breeder of sinners?\"; that line was supposed to have occurred in THAT scene, NOT where it was placed in the film (after the \"To Be Or Not To Be\" soliloquy. This version struggles between cutting out too much or too little from an excellent piece of literature. Kenneth Branagh would remedy that 5 years later with his uncut version of the tragedy, making HIS version a more fitting homage to Sir Laurence Olivier, as several of the actors (aside from him) had performed \"Hamlet\" on stage/or on film many times on different occasions. However, Zeffirelli's take on \"Hamlet\" IS faithful to the play and THAT's what I was looking for. The setup for the final act duel was the same as in Olivier and Branagh's versions, only that the denouement in Branagh's version was more violent than the denouement of the previous two faithful versions (more in line with the play; Olivier toned it down...and it worked equally well) and stuck more closely to the play, with Branagh throwing in a few harmless touches of his own...to very good effect. <br /><br />This version is Not Rated.", "label": 0, "predicted": 1}]